Core/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаИнформационноеОбслуживаниеНалогоплательщика</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУслуги</name>
    <type>
      <types>EnumRef.ВидыУслугПриИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОтвета</name>
    <type>
      <types>EnumRef.ФорматОтветаНаЗапросИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставленияСправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйПараметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматЗапроса</name>
    <type>
      <types>EnumRef.ФорматыДокументооборотаСФНС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНалогов</name>
    <type>
      <types>EnumRef.КоличествоНалоговДляСверкиИОН</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеНалоги</name>
    <attributes>
      <name>КБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКАТО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ВидыУслугПриИОН/ВидыУслугПриИОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУслугПриИОН</name>
  <enumValues>
    <name>ПредставлениеАктовСверкиРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ПредставлениеВыпискиОперацийИзКарточкиРасчетыСБюджетом</name>
  </enumValues>
  <enumValues>
    <name>ПредставлениеПеречняБухгалтерскойИНалоговойОтчетности</name>
  </enumValues>
  <enumValues>
    <name>ПредставлениеСправкиОСостоянииРасчетовСБюджетом</name>
  </enumValues>
  <enumValues>
    <name>ПредставлениеСправкиОбИсполненииОбязанностейПоУплате</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ФорматОтветаНаЗапросИОН/ФорматОтветаНаЗапросИОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматОтветаНаЗапросИОН</name>
  <enumValues>
    <name>TXT</name>
  </enumValues>
  <enumValues>
    <name>PDF</name>
  </enumValues>
  <enumValues>
    <name>RTF</name>
  </enumValues>
  <enumValues>
    <name>XML</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>УдалитьXLS</name>
  </enumValues>
  <enumValues>
    <name>XLS</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/КоличествоНалоговДляСверкиИОН/КоличествоНалоговДляСверкиИОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КоличествоНалоговДляСверкиИОН</name>
  <enumValues>
    <name>Один</name>
  </enumValues>
  <enumValues>
    <name>Несколько</name>
  </enumValues>
  <enumValues>
    <name>Все</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(СообщениеОснование)
	
	Если РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("Справочники.Организации");
		Организация = Модуль.ОрганизацияПоУмолчанию();
	КонецЕсли;

	ТекущаяДата = ТекущаяДатаСеанса();
	Если Месяц(ТекущаяДата) < 4 Тогда
		// Предлагаем сделать сверки за предыдущий год
		
		ПрошлыйГод 			 = КонецГода(ДобавитьМесяц(ТекущаяДата, - 12));
		
		ДатаОкончанияПериода = ПрошлыйГод;
		ДатаНачалаПериода 	 = НачалоГода(ДатаОкончанияПериода);
		
	Иначе
		// Предлагаем сделать сверки за текущий год
		
		ДатаОкончанияПериода = ТекущаяДата;
		ДатаНачалаПериода 	 = НачалоГода(ДатаОкончанияПериода);
		
	КонецЕсли;
	
	Если ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеСправкиОбИсполненииОбязанностейПоУплате Тогда
		ФорматОтвета = Перечисления.ФорматОтветаНаЗапросИОН.XML;
	Иначе
		ФорматОтвета = ПоследнийИспользуемыйФорматОтвета();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеАктовСверкиРасчетов
		ИЛИ ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеВыпискиОперацийИзКарточкиРасчетыСБюджетом Тогда
		
		Ошибки = Новый Массив;
		Для Каждого СтрокаТаблицы Из ЗапрашиваемыеНалоги Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.КБК) И СтрДлина(СтрокаТаблицы.КБК) <> 20 Тогда
				
				ТекстСообщения = НСтр("ru='Введено некорректное значение КБК %1"
"Длина КБК должна быть равна 20 символам';ka='Введено некорректное значение КБК %1"
"Длина КБК должна быть равна 20 символам'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.КБК);
				Ошибки.Добавить(ТекстСообщения);
				
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТаблицы.КБК) Тогда
				
				ТекстСообщения = НСтр("ka='Не заполнен КБК';ru='Не заполнен КБК'");
				Ошибки.Добавить(ТекстСообщения);
				
			КонецЕсли;
			
			ОКАТОНевернойДлины = СтрДлина(СтрокаТаблицы.ОКАТО) <> 11 И СтрДлина(СтрокаТаблицы.ОКАТО) <> 8;
			Если ЗначениеЗаполнено(СтрокаТаблицы.ОКАТО) И ОКАТОНевернойДлины
				ИЛИ Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаТаблицы.ОКАТО) Тогда
				
				ТекстСообщения = НСтр("ru='Введено некорректное значение ОКАТО или ОКТМО %1"
"Код ОКАТО/ОКТМО должен иметь длину 8 или 11 и состоять только из цифр.';ka='Введено некорректное значение ОКАТО или ОКТМО %1"
"Код ОКАТО/ОКТМО должен иметь длину 8 или 11 и состоять только из цифр.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.ОКАТО);
				Ошибки.Добавить(ТекстСообщения);
				
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТаблицы.ОКАТО) Тогда
				
				ТекстСообщения = НСтр("ka='Не заполнено ОКАТО или ОКТМО';ru='Не заполнено ОКАТО или ОКТМО'");
				Ошибки.Добавить(ТекстСообщения);
				
			КонецЕсли;
				
		КонецЦикла;
		
		// Вывод полученнных ошибок. Только уникальные ошибки.
		Ошибки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Ошибки);
		Для каждого Ошибка Из Ошибки Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Ошибка, 
				ЭтотОбъект, 
				,
				,
				Отказ);
			
		КонецЦикла; 
		
		МассивНепроверяемыхРеквизитов.Добавить("ЗапрашиваемыеНалоги");
		МассивНепроверяемыхРеквизитов.Добавить("ЗапрашиваемыеНалоги.КБК");
		МассивНепроверяемыхРеквизитов.Добавить("ЗапрашиваемыеНалоги.ОКАТО");
		
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ЗапрашиваемыеНалоги");
		МассивНепроверяемыхРеквизитов.Добавить("ЗапрашиваемыеНалоги.КБК");
		МассивНепроверяемыхРеквизитов.Добавить("ЗапрашиваемыеНалоги.ОКАТО");
	КонецЕсли;
	
	Если ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеВыпискиОперацийИзКарточкиРасчетыСБюджетом Тогда
		Если Не ЗначениеЗаполнено(ДатаОкончанияПериода) Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ДатаНачалаПериода");
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияПериода");
			ТекстСообщения = НСтр("ka='Поле ""За год"" не заполнено';ru='Поле ""За год"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаОкончанияПериода",, Отказ);
		КонецЕсли;		
	КонецЕсли;
	
	Если ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеСправкиОСостоянииРасчетовСБюджетом Тогда
		Если Не ЗначениеЗаполнено(ДатаОкончанияПериода) Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ДатаНачалаПериода");
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияПериода");
			ТекстСообщения = НСтр("ka='Поле ""На дату"" не заполнено';ru='Поле ""На дату"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаОкончанияПериода",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("ДополнительныйПараметр");
	Если ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеПеречняБухгалтерскойИНалоговойОтчетности Тогда
		Если Не ЗначениеЗаполнено(ДополнительныйПараметр) Тогда
			ТекстСообщения = НСтр("ka='Поле ""Виды отчетов"" не заполнено';ru='Поле ""Виды отчетов"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДополнительныйПараметр",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если (ВидУслуги = ПредопределенноеЗначение("Перечисление.ВидыУслугПриИОН.ПредставлениеАктовСверкиРасчетов")
		ИЛИ ВидУслуги = ПредопределенноеЗначение("Перечисление.ВидыУслугПриИОН.ПредставлениеВыпискиОперацийИзКарточкиРасчетыСБюджетом"))
		И КоличествоНалогов = Перечисления.КоличествоНалоговДляСверкиИОН.Несколько
		И ЗапрашиваемыеНалоги.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ka='Укажите налоги или КБК, по которым запрашивается сверка';ru='Укажите налоги или КБК, по которым запрашивается сверка'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ЗапрашиваемыеНалоги",, Отказ);
			
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПоследнийИспользуемыйФорматОтвета()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.ФорматОтвета
	|ИЗ
	|	Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика КАК ЗапросНаИнформационноеОбслуживаниеНалогоплательщика
	|ГДЕ
	|	ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.ВидУслуги <> ЗНАЧЕНИЕ(Перечисление.ВидыУслугПриИОН.ПредставлениеСправкиОбИсполненииОбязанностейПоУплате)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Дата УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Перечисления.ФорматОтветаНаЗапросИОН.RTF;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.ФорматОтвета;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
